//GLUT使用の宣言
#include <GL/glut.h>
#include <math.h>

#define PI 3.141592
double er = 4.3, ew = 0.4;

//再描画イベント発生用の関数
void idle(void)
{
	//glutDisplayFunc()で指定されている描画関数が実行される
	glutPostRedisplay();
}

//ウィンドウ内に描画する関数
void buttai(void)
{
	int i,j;
	//static double r = 0.0;
	//物体の各点
	GLdouble vertex[72][3] = {
		{-0.5, -0.5, -0.5}, {-0.1, -0.5, -0.5},
		{-0.1, -0.1, -0.5}, {-0.5, -0.1, -0.5}, 
		{-0.5, -0.5, -0.1}, {-0.1, -0.5, -0.1}, 
		{-0.1, -0.1, -0.1}, {-0.5, -0.1, -0.1},

		{0.1, -0.5, -0.5}, {0.5, -0.5, -0.5},
		{0.5, -0.1, -0.5}, {0.1, -0.1, -0.5},
		{0.1, -0.5, -0.1}, {0.5, -0.5, -0.1},
		{0.5, -0.1, -0.1}, {0.1, -0.1, -0.1},

		{0.1, 0.1, -0.5}, {0.5, 0.1, -0.5},
		{0.5, 0.5, -0.5}, {0.1, 0.5, -0.5},
		{0.1, 0.1, -0.1}, {0.5, 0.1, -0.1},
		{0.5, 0.5, -0.1}, {0.1, 0.5, -0.1},

		{-0.5, 0.1, -0.5}, {-0.1, 0.1, -0.5},
		{-0.1, 0.5, -0.5}, {-0.5, 0.5, -0.5},
		{-0.5, 0.1, -0.1}, {-0.1, 0.1, -0.1},
		{-0.1, 0.5, -0.1}, {-0.5, 0.5, -0.1},

		{-0.5, -0.5, 0.1}, {-0.1, -0.5, 0.1},
		{-0.1, -0.1, 0.1}, {-0.5, -0.1, 0.1},
		{-0.5, -0.5, 0.5}, {-0.1, -0.5, 0.5},
		{-0.1, -0.1, 0.5}, {-0.5, -0.1, 0.5},

		{0.1, -0.5, 0.1}, {0.5, -0.5, 0.1},
		{0.5, -0.1, 0.1}, {0.1, -0.1, 0.1},
		{0.1, -0.5, 0.5}, {0.5, -0.5, 0.5},
		{0.5, -0.1, 0.5}, {0.1, -0.1, 0.5},

		{0.1, 0.1, 0.1}, {0.5, 0.1, 0.1},
		{0.5, 0.5, 0.1}, {0.1, 0.5, 0.1},
		{0.1, 0.1, 0.5}, {0.5, 0.1, 0.5},
		{0.5, 0.5, 0.5}, {0.1, 0.5, 0.5},
		
		{-0.5, 0.1, 0.1}, {-0.1, 0.1, 0.1},
		{-0.1, 0.5, 0.1}, {-0.5, 0.5, 0.1},
		{-0.5, 0.1, 0.5}, {-0.1, 0.1, 0.5},
		{-0.1, 0.5, 0.5}, {-0.5, 0.5, 0.5},

		{-0.4, -0.4, -0.4}, {0.4, -0.4, -0.4},
		{0.4, 0.4, -0.4}, {-0.4, 0.4, -0.4},
		{-0.4, -0.4, 0.4}, {0.4, -0.4, 0.4},
		{0.4, 0.4, 0.4}, {-0.4, 0.4, 0.4}
	};
	//物体の各面　表に対して左回り
	int face[54][4] = {
		{0,3,2,1}, {1,2,6,5}, {4,5,6,7},
		{0,4,7,3}, {0,1,5,4}, {2,3,7,6},

		{8,11,10,9}, {9,10,14,13}, {12,13,14,15},
		{8,12,15,11}, {8,9,13,12}, {10,11,15,14},

		{16,19,18,17}, {17,18,22,21}, {20,21,22,23},
		{16,20,23,19}, {16,17,21,20}, {18,19,23,22},

		{24,27,26,25}, {25,26,30,29}, {28,29,30,31},
		{24,28,31,27}, {24,25,29,28}, {26,27,31,30},

	        {32,35,34,33}, {33,34,38,37}, {36,37,38,39},
		{32,36,39,35}, {32,33,37,36}, {34,35,39,38},

		{40,43,42,41}, {41,42,46,45}, {44,45,46,47},
		{40,44,47,43}, {40,41,45,44}, {42,43,47,46},

		{48,51,50,49}, {49,50,54,53}, {52,53,54,55},
		{48,52,55,51}, {48,49,53,52}, {50,51,55,54},

		{56,59,58,57}, {57,58,62,61}, {60,61,62,63},
		{56,60,63,59}, {56,57,61,60}, {58,59,63,62},

		{64,67,66,65}, {65,66,70,69}, {68,69,70,71},
	        {64,68,71,67}, {64,65,69,68}, {66,67,71,70}	
	};
	//物体の各面の色
	/*
	GLdouble color[6][3] = {
		{1.0,0.0,0.0},{0.0,1.0,0.0},{0.0,0.0,1.0},
		{1.0,1.0,0.0},{0.0,1.0,1.0},{1.0,0.0,1.0}
	};
	*/

	//追加2
	GLdouble normal[6][3] = {
		{ 0.0, 0.0,-1.0},{ 1.0, 0.0, 0.0},{ 0.0, 0.0, 1.0},
		{-1.0, 0.0, 0.0},{ 0.0,-1.0, 0.0},{ 0.0, 1.0, 0.0}
	};
	glBegin(GL_QUADS);
	//描画
	//面の数j
	for(j=0; j<54; j++) {
		//面毎に色を指定 3dv...?
		//glColor3dv(color[j%6]);
		glNormal3dv(normal[j%6]);//追加2
		//面の点の数i
		for(i=0; i<4; i++) {
			//4点の指定から面の描画
			glVertex3dv(vertex[face[j][i]]);
		}
	}
	//描画終了
	glEnd();
}

void display(void)
{
	static double r = 0.0;
	//追加2
	GLfloat lpos[4] = {5.0*cos(r/180*3.1415), 5.0, 5.0*sin(r/180*3.1415), 1.0};
	GLfloat lcol[4] = {0.5, 1.0, 0.5, 1.0};
	GLfloat mcol[4] = {1.0, 0.5, 0.5, 1.0};

	//ウィンドウを塗りつぶす(初期化) 白(引数の初期値)
	glClear(GL_COLOR_BUFFER_BIT | GL_DEPTH_BUFFER_BIT/*修正*/);
	glEnable(GL_DEPTH_TEST);//追加
	glEnable(GL_LIGHTING);//追加2
	glEnable(GL_LIGHT0);//追加2

	//変数行列の初期化
	glLoadIdentity();
	//視点の位置xyz、目標の位置xyz、ウィンドウに表示される画像の上方向を示すベクトル
	gluLookAt(5.0*cos(ew)*cos(er), 5.0*sin(ew), 5.0*cos(ew)*sin(er),
			0.0, 0.0, 0.0,
			-sin(ew)*cos(er), cos(ew), -sin(ew)*sin(er));
	//追加2
	glLightfv(GL_LIGHT0, GL_POSITION, lpos);
	//回転の行列　回転角(弧度法)、回転軸の方向ベクトルxyz
	glRotated(/*(GLdouble)r*/0.0, 0.0, 1.0, 0.0);

	//描画する物の色(ここでは初期化?)
	//glColor3d(0.0, 0.0, 0.0);
	/*
	//描画開始の宣言 4点を組にして四角形を描く(GL_QUADS)
	glBegin(GL_QUADS);
	//描画
	//面の数j
	for(j=0; j<54; j++) {
		//面毎に色を指定 3dv...?
		//glColor3dv(color[j%6]);
		glNormal3dv(normal[j%6]);//追加2
		//面の点の数i
		for(i=0; i<4; i++) {
			//4点の指定から面の描画
			glVertex3dv(vertex[face[j][i]]);
		}
	}
	//描画終了
	glEnd();
	*/
	buttai();
	//フラッシュ 要調査
	glFlush();
	glDisable(GL_LIGHT0);//追加2
	glDisable(GL_LIGHTING);//追加2
	glDisable(GL_DEPTH_TEST);//追加

	//描画面の逆転 (2枚の画像を交互に更新・描画している)
	glutSwapBuffers();

	//回転角の更新 尚且つ数値の制限
	r += 0.1;
	if(r >= 360.0) r = 0.0;
}

//ウィンドウサイズに合わせてリサイズ
void resize(int w, int h)
{
	//開いたウィンドウの中で描画が行われる領域　左下隅xy,幅,高さ　だから以下のように書けばいい
	glViewport(0, 0, w, h);
	//設定する変換行列の指定　投影変換行列を指定(GL_PROJECTION)
	glMatrixMode(GL_PROJECTION);
	//変数行列の初期化　ここでも
	glLoadIdentity();
	//透視変換の行列を乗じる　視野角(弧度法),画面の縦横比,奥行き範囲手前と後方の位置
	gluPerspective(30.0, 1.0, 1.0, 10.0);
	//設定する変換行列の指定　モデルビュー変換行列にする(GL_MODELVIEW)
	glMatrixMode(GL_MODELVIEW);
}

//キーボード入力時のイベント処理
void keyboard(unsigned char key, int x, int y)
{
	//Escキーで終了
	if (key == '\033') exit(0);
}

//追加3
void specialkey(int key, int x, int y){
	if(key == GLUT_KEY_LEFT){
		er += .1;
		if(er >= 2*PI) er=0;
	}
	else if(key == GLUT_KEY_RIGHT){
		er -= .1;
		if(er <= 0) er = 2*PI;
	}
	else if(key == GLUT_KEY_UP){
		ew += .1;
		if(ew >= 2*PI) ew = 0;
	}
	else if(key == GLUT_KEY_DOWN){
		ew -= .1;
		if(ew <= 0) ew = 2*PI;
	}
}


//main関数
int main(int argc, char *argv[])
{
	//OpenGL環境の初期化
	glutInit(&argc, argv);
	//ディスプレイの表示モード設定
	glutInitDisplayMode(GLUT_RGBA | GLUT_DOUBLE | GLUT_DEPTH/*修正*/);
	//ウィンドウを開く 引数はウィンドウの名前
	glutCreateWindow(argv[0]);
	glClearColor(1.0, 1.0, 1.0, 0.0);
	//開いたウィンドウ内に描画する関数
	glutDisplayFunc(display);
	//キーが押された時に実行する関数
	glutKeyboardFunc(keyboard);
	//追加3
	glutSpecialFunc(specialkey);
	//何もすることがないときに実行する関数
	glutIdleFunc(idle);
	//リサイズされた時に実行する関数
	glutReshapeFunc(resize);
	//無限ループ
	glutMainLoop();
}
